{"keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 45, 45, 2], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "filters": 64, "trainable": true, "kernel_size": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "units": 1024, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "rate": 0.35, "name": "dropout_1", "noise_shape": null, "trainable": true}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "units": 2025, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "name": "model_2", "output_layers": [["dense_2", 0, 0]]}}