{"keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 45, 45, 2], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_2", "config": {"bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_3", "config": {"bias_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "units": 1024, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_1", "config": {"seed": null, "name": "dropout_1", "rate": 0.0, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "trainable": true, "units": 200, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}]}, "backend": "tensorflow"}