{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 100, 100, 2]}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activation": "relu", "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5]}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activation": "relu", "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5]}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "name": "conv2d_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 16, "kernel_size": [3, 3]}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_constraint": null, "units": 5000, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_1"}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "rate": 0.1, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_constraint": null, "units": 500, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense", "name": "dense_2"}], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}