{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "dtype": "float32", "units": 1024, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 2025], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.35, "name": "dropout_2", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "units": 16928, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [23, 23, 32], "trainable": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_transpose_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_transpose_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "conv2d_transpose_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "padding": "same", "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "sigmoid", "kernel_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 2, "trainable": true, "kernel_size": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}]}