{"config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 45, 45, 2], "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 16, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.1, "seed": null, "noise_shape": null, "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 500, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "trainable": true}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}