{"config": {"name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 100, 100, 2], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_1"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_2"}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_3"}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 5000, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.0, "name": "dropout_1", "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 200, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}