{"config": {"name": "model_3", "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 500], "name": "input_2"}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "name": "dense_4", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"units": 2304, "bias_regularizer": null, "name": "dense_5", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [12, 12, 16], "trainable": true}}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 16, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_transpose_1", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "output_padding": null, "kernel_constraint": null, "trainable": true}}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_transpose_2", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "output_padding": null, "kernel_constraint": null, "trainable": true}}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_transpose_3", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "output_padding": null, "kernel_constraint": null, "trainable": true}}, {"name": "bilinear_upsampling_1", "class_name": "BilinearUpsampling", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "config": {"name": "bilinear_upsampling_1", "upsampling": null, "trainable": true, "data_format": "channels_last", "output_size": [45, 45]}}, {"name": "generated", "class_name": "Conv2D", "inbound_nodes": [[["bilinear_upsampling_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "filters": 2, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "generated", "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 2], "activation": "sigmoid", "kernel_constraint": null, "trainable": true}}], "input_layers": [["input_2", 0, 0]], "output_layers": [["generated", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}