{"keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["generated", 0, 0]], "name": "model_3", "input_layers": [["input_2", 0, 0]], "layers": [{"name": "input_2", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 200], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_4", "config": {"bias_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "units": 1024, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"bias_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "units": 1152, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 6, 32]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "conv2d_transpose_1", "config": {"bias_constraint": null, "name": "conv2d_transpose_1", "output_padding": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "conv2d_transpose_2", "config": {"bias_constraint": null, "name": "conv2d_transpose_2", "output_padding": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "conv2d_transpose_3", "config": {"bias_constraint": null, "name": "conv2d_transpose_3", "output_padding": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "bilinear_upsampling_1", "config": {"name": "bilinear_upsampling_1", "output_size": [45, 45], "trainable": true, "data_format": "channels_last", "upsampling": null}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "BilinearUpsampling"}, {"name": "generated", "config": {"bias_constraint": null, "name": "generated", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "filters": 2, "kernel_size": [2, 2], "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "data_format": "channels_last"}, "inbound_nodes": [[["bilinear_upsampling_1", 0, 0, {}]]], "class_name": "Conv2D"}]}, "backend": "tensorflow"}