{"backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "name": "model_3", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 500]}, "class_name": "InputLayer", "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_constraint": null, "units": 5000, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_4"}, "class_name": "Dense", "name": "dense_4"}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_constraint": null, "units": 10000, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_5"}, "class_name": "Dense", "name": "dense_5"}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape_1", "target_shape": [25, 25, 16]}, "class_name": "Reshape", "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "name": "conv2d_transpose_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 16, "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1"}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activation": "relu", "name": "conv2d_transpose_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "filters": 32, "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2"}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activation": "relu", "name": "conv2d_transpose_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "filters": 32, "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3"}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "bilinear_upsampling_1", "output_size": [100, 100], "upsampling": null}, "class_name": "BilinearUpsampling", "name": "bilinear_upsampling_1"}, {"inbound_nodes": [[["bilinear_upsampling_1", 0, 0, {}]]], "config": {"padding": "same", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "sigmoid", "name": "generated", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 2, "kernel_size": [2, 2]}, "class_name": "Conv2D", "name": "generated"}], "output_layers": [["generated", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}