{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 100, 100, 2], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "filters": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "name": "conv2d_2", "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "name": "conv2d_3", "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_4", "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5000, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.1}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "config": {"trainable": true, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10000, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "keras_version": "2.1.5", "class_name": "Model"}