{"config": {"name": "model_3", "layers": [{"config": {"batch_input_shape": [null, 200], "sparse": false, "name": "input_2", "dtype": "float32"}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 5000, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4"}, "name": "dense_4", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 5408, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5"}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [13, 13, 32]}, "name": "reshape_1", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_transpose_1"}, "name": "conv2d_transpose_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_transpose_2"}, "name": "conv2d_transpose_2", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [5, 5], "name": "conv2d_transpose_3"}, "name": "conv2d_transpose_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "data_format": "channels_last", "upsampling": null, "name": "bilinear_upsampling_1", "output_size": [100, 100]}, "name": "bilinear_upsampling_1", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "BilinearUpsampling"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "sigmoid", "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 2, "kernel_size": [2, 2], "name": "generated"}, "name": "generated", "inbound_nodes": [[["bilinear_upsampling_1", 0, 0, {}]]], "class_name": "Conv2D"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["generated", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}