{"backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["generated", 0, 0]], "name": "model_3", "layers": [{"inbound_nodes": [], "name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 10000], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_4", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5000, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10000, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [25, 25, 16]}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv2d_transpose_1", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_transpose_1", "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2DTranspose"}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_transpose_2", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "name": "conv2d_transpose_2", "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2DTranspose"}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "name": "conv2d_transpose_3", "config": {"trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "name": "conv2d_transpose_3", "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2DTranspose"}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "name": "bilinear_upsampling_1", "config": {"trainable": true, "upsampling": null, "data_format": "channels_last", "output_size": [100, 100], "name": "bilinear_upsampling_1"}, "class_name": "BilinearUpsampling"}, {"inbound_nodes": [[["bilinear_upsampling_1", 0, 0, {}]]], "name": "generated", "config": {"trainable": true, "use_bias": true, "activation": "sigmoid", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "name": "generated", "bias_regularizer": null, "filters": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}]}, "keras_version": "2.1.5", "class_name": "Model"}